constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;
    libs            ("libfvMotionSolvers.so");
    motionSolver    solidBody;
    cellZone        innerCylinder;
    solidBodyMotionFunction  rotatingMotion;
    origin          (0 0 0);
    axis            (0 0 1);
    omega           100 [rpm];
}

// ************************************************************************* //
