constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}

phases          (oil air);
//              ^^^ renamed from water to oil

// Surface tension between oil and air (N/m)
// Typical ATF/gear oil: ~0.03-0.035 N/m
// Water is 0.07 for reference
sigma           0.032;

// ************************************************************************* //
