system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}

solvers
{
    alpha.oil
    {
        nAlphaCorr          1;
        nAlphaSubCycles     3;
    }

    "pcorr.*"
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       0.02;
        relTol          0;
    }

    p_rgh
    {
        $pcorr;
        tolerance       1e-8;
        relTol          0.01;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.01;
    }

    UFinal
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor       no;
    nOuterCorrectors        1;
    nCorrectors             1;

    // We have 18 non-orthogonal faces > 70°
    // 2 correctors handles this safely
    nNonOrthogonalCorrectors 0;

    correctPhi              yes;
    correctMeshPhi          no;
}

relaxationFactors
{
    equations
    {
        ".*"    1;
    }
}

// ************************************************************************* //
