system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Only creates cellZones — createBaffles handles the interface faces
// via searchableCylinder geometry directly.
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // rotatingZone — cells inside r=65mm cylinder
    {
        name    rotatingZone;
        type    cellZoneSet;
        action  new;
        source  cylinderToCell;
        p1      (0 0 -0.030);
        p2      (0 0  0.030);
        radius  0.065;
    }

    // stationaryZone — everything else
    {
        name    rotatingCells;
        type    cellSet;
        action  new;
        source  zoneToCell;
        zone    rotatingZone;
    }
    {
        name    stationaryCells;
        type    cellSet;
        action  new;
        source  cellToCell;
        set     rotatingCells;
    }
    {
        name    stationaryCells;
        type    cellSet;
        action  invert;
    }
    {
        name    stationaryZone;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     stationaryCells;
    }
);

// ************************************************************************* //
